src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Самопроверка/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Автотесты бизнес-логики (минимальный xUnit без внешних фреймворков).
//
// Каждый тест выполняется в отдельной транзакции, которая всегда откатывается, - тесты создают
// свои справочники и документы и не оставляют следов в базе. Поэтому запускать их можно
// и на базе с рабочими данными.
//
// Негативные тесты (ожидается отказ проведения) проверяют текст сообщения. После отказа
// транзакция считается испорченной, поэтому ожидаемый отказ - всегда последнее действие теста.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет все тесты модуля.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//   * Тест - Строка - имя процедуры теста.
//   * Описание - Строка - что проверяет тест.
//   * Успешно - Булево - результат.
//   * Сообщение - Строка - причина падения.
//   * Длительность - Число - время выполнения, мс.
//
Функция ВыполнитьВсеТесты() Экспорт

	Результаты = Новый ТаблицаЗначений;
	Результаты.Колонки.Добавить("Тест");
	Результаты.Колонки.Добавить("Описание");
	Результаты.Колонки.Добавить("Успешно");
	Результаты.Колонки.Добавить("Сообщение");
	Результаты.Колонки.Добавить("Длительность");

	Для Каждого Тест Из СписокТестов() Цикл

		Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбщегоНазначения.ЗабратьСообщенияПользователю();

		// Транзакция теста намеренно никогда не фиксируется - только откатывается.
		// Имя процедуры берется из СписокТестов(), внешний ввод в Выполнить() не попадает.
		// BSLLS:PairingBrokenTransaction-off
		// BSLLS:WrongUseOfRollbackTransactionMethod-off
		// BSLLS:ExecuteExternalCodeInCommonModule-off
		НачатьТранзакцию();
		Попытка
			Выполнить("Самопроверка." + Тест.Значение + "()");
			Успешно = Истина;
			Сообщение = "";
		Исключение
			Успешно = Ложь;
			Сообщение = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		// BSLLS:WrongUseOfRollbackTransactionMethod-on
		// BSLLS:PairingBrokenTransaction-on

		ОбщегоНазначения.ЗабратьСообщенияПользователю();

		Результат = Результаты.Добавить();
		Результат.Тест = Тест.Значение;
		Результат.Описание = Тест.Представление;
		Результат.Успешно = Успешно;
		Результат.Сообщение = Сообщение;
		Результат.Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;

	КонецЦикла;

	Возврат Результаты;

КонецФункции

// Формирует отчет о прогоне тестов.
//
// Параметры:
//  Результаты - ТаблицаЗначений - результат ВыполнитьВсеТесты().
//
// Возвращаемое значение:
//  ТабличныйДокумент - отчет: зеленые строки - пройденные тесты, красные - упавшие.
//
Функция ОтчетОПрогоне(Результаты) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Область("C1").ШиринаКолонки = 4;
	ТабличныйДокумент.Область("C2").ШиринаКолонки = 70;
	ТабличныйДокумент.Область("C3").ШиринаКолонки = 10;
	ТабличныйДокумент.Область("C4").ШиринаКолонки = 70;

	Пройдено = 0;
	Для Каждого Результат Из Результаты Цикл
		Пройдено = Пройдено + ?(Результат.Успешно, 1, 0);
	КонецЦикла;

	Ячейка = ТабличныйДокумент.Область(1, 1, 1, 4);
	Ячейка.Объединить();
	Ячейка.Текст = СтрШаблон(НСтр("ru = 'Самопроверка: пройдено %1 из %2'"), Пройдено, Результаты.Количество());
	Ячейка.Шрифт = Новый Шрифт(, 12, Истина);
	Ячейка.ЦветТекста = ?(Пройдено = Результаты.Количество(), ЦветУспеха(), ЦветОшибки());

	Ряд = 3;
	Для Каждого Результат Из Результаты Цикл
		ВывестиЯчейку(ТабличныйДокумент, Ряд, 1, ?(Результат.Успешно, "OK", "FAIL"), Результат.Успешно);
		ВывестиЯчейку(ТабличныйДокумент, Ряд, 2, Результат.Описание, Результат.Успешно);
		ВывестиЯчейку(ТабличныйДокумент, Ряд, 3, Формат(Результат.Длительность, "ЧН=0; ЧГ=0") + " мс", Результат.Успешно);
		ВывестиЯчейку(ТабличныйДокумент, Ряд, 4, Результат.Сообщение, Результат.Успешно);
		Ряд = Ряд + 1;
	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Тесты - экспортные, чтобы их можно было вызвать по имени из ВыполнитьВсеТесты().

// Проверка ИНН: длина, только цифры, контрольные разряды для 10 и 12 знаков.
Процедура Тест_ПроверкаИНН() Экспорт

	ПроверитьИстину(КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("7707083893", Истина),
		"корректный ИНН организации");
	ПроверитьИстину(Не КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("7707083894", Истина),
		"неверная контрольная цифра ИНН организации");
	ПроверитьИстину(КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("500100732259", Ложь),
		"корректный ИНН ИП");
	ПроверитьИстину(Не КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("500100732258", Ложь),
		"неверная контрольная цифра ИНН ИП");
	ПроверитьИстину(Не КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("77070838", Истина),
		"неверная длина");
	ПроверитьИстину(Не КонтрагентыКлиентСервер.ИННСоответствуетТребованиям("77070A3893", Истина),
		"буква в ИНН");

КонецПроцедуры

// FIFO: две партии по 100 и 120, продажа 15 шт. списывает 10 x 100 + 5 x 120 = 1600,
// во второй партии остается 5 шт. на 600.
Процедура Тест_СписаниеПартийПоFIFO() Экспорт

	К = НовыйКонтекст();
	Партия1 = Поступление(К, К.Товар, 10, 100, 3);
	Партия2 = Поступление(К, К.Товар, 10, 120, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 15, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

	ПроверитьРавенство(СебестоимостьПродажи(Продажа.Ссылка), 1600, "себестоимость продажи");
	ПроверитьРавенство(ОстатокПартии(Партия1, "Количество"), 0, "остаток первой партии");
	ПроверитьРавенство(ОстатокПартии(Партия2, "Количество"), 5, "количество во второй партии");
	ПроверитьРавенство(ОстатокПартии(Партия2, "Стоимость"), 600, "стоимость второй партии");

КонецПроцедуры

// Нельзя продать больше, чем есть на складе.
Процедура Тест_КонтрольОстатковПриРеализации() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 11, 200);
	ПроверитьОтказПроведения(Продажа, "Недостаточно");

КонецПроцедуры

// Одна номенклатура в двух строках (6 + 6 при остатке 10) не должна обходить контроль остатков.
Процедура Тест_ПовторяющаясяНоменклатураНеОбходитКонтроль() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 6, 200);
	ДобавитьТовар(Продажа, К.Товар, 6, 200);
	ПроверитьОтказПроведения(Продажа, "Недостаточно");

КонецПроцедуры

// Резерв под заказ уменьшает свободный остаток: 10 на складе, 7 в резерве - продать 5 без заказа нельзя.
Процедура Тест_РезервУменьшаетСвободныйОстаток() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 3);
	Заказ(К, К.Товар, 7, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 5, 200);
	ПроверитьОтказПроведения(Продажа, "свободного остатка");

КонецПроцедуры

// Реализация на основании заказа снимает резерв и закрывает остаток к отгрузке;
// после этого оставшиеся 3 шт. свободны и продаются без заказа.
Процедура Тест_РеализацияПоЗаказуСнимаетРезерв() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 4);
	ЗаказСсылка = Заказ(К, К.Товар, 7, 3);

	Отгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	Отгрузка.Дата = МоментНазад(2);
	Отгрузка.Заполнить(ЗаказСсылка);
	ПроверитьРавенство(Отгрузка.Товары.Итог("Количество"), 7, "заполнение по остатку заказа");
	Отгрузка.Записать(РежимЗаписиДокумента.Проведение);

	ПроверитьРавенство(ОстатокРегистра("ТоварыВРезерве", "Количество", Новый Структура("ЗаказКлиента", ЗаказСсылка)), 0,
		"резерв по заказу после отгрузки");
	ПроверитьРавенство(ОстатокРегистра("ЗаказыКлиентов", "Количество", Новый Структура("ЗаказКлиента", ЗаказСсылка)), 0,
		"остаток к отгрузке по заказу");

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 3, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

	ПроверитьРавенство(ОстатокРегистра("ТоварыНаСкладах", "Количество", Новый Структура("Номенклатура", К.Товар)), 0,
		"остаток на складе");

КонецПроцедуры

// Закрытие частично отгруженного заказа освобождает неиспользованный резерв и обнуляет остаток к отгрузке,
// не уводя регистры в минус.
Процедура Тест_ЗакрытиеЗаказаОсвобождаетРезерв() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 4);
	ЗаказСсылка = Заказ(К, К.Товар, 7, 3);

	Отгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	Отгрузка.Дата = МоментНазад(2);
	Отгрузка.Заполнить(ЗаказСсылка);
	Отгрузка.Товары[0].Количество = 3;
	Отгрузка.Записать(РежимЗаписиДокумента.Проведение);

	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);

	Отбор = Новый Структура("ЗаказКлиента", ЗаказСсылка);
	ПроверитьРавенство(ОстатокРегистра("ТоварыВРезерве", "Количество", Отбор), 0, "резерв закрытого заказа");
	ПроверитьРавенство(ОстатокРегистра("ЗаказыКлиентов", "Количество", Отбор), 0, "остаток к отгрузке закрытого заказа");

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 7, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

// Реализацию по уже закрытому заказу можно перепровести (это делает пересчет себестоимости),
// а новую отгрузку по закрытому заказу - нельзя.
Процедура Тест_ПерепроведениеОтгрузкиПоЗакрытомуЗаказу() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 4);
	ЗаказСсылка = Заказ(К, К.Товар, 7, 3);

	Отгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	Отгрузка.Дата = МоментНазад(2);
	Отгрузка.Заполнить(ЗаказСсылка);
	Отгрузка.Товары[0].Количество = 3;
	Отгрузка.Записать(РежимЗаписиДокумента.Проведение);

	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);

	Отгрузка.Записать(РежимЗаписиДокумента.Проведение);

	НоваяОтгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	НоваяОтгрузка.Дата = МоментНазад(1);
	НоваяОтгрузка.Контрагент = К.Клиент;
	НоваяОтгрузка.Склад = К.Склад;
	НоваяОтгрузка.ЗаказКлиента = ЗаказСсылка;
	ДобавитьТовар(НоваяОтгрузка, К.Товар, 1, 200);
	ПроверитьОтказПроведения(НоваяОтгрузка, "К отгрузке");

КонецПроцедуры

// По заказу нельзя отгрузить больше, чем заказано.
Процедура Тест_ОтгрузкаСверхЗаказаЗапрещена() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 4);
	ЗаказСсылка = Заказ(К, К.Товар, 2, 3);

	Отгрузка = Документы.РеализацияТоваров.СоздатьДокумент();
	Отгрузка.Дата = МоментНазад(2);
	Отгрузка.Заполнить(ЗаказСсылка);
	Отгрузка.Товары[0].Количество = 3;
	ПроверитьОтказПроведения(Отгрузка, "сверх заказанного");

КонецПроцедуры

// Перемещение переносит партию на другой склад вместе с ее себестоимостью.
Процедура Тест_ПеремещениеПереноситПартию() Экспорт

	К = НовыйКонтекст();
	Партия = Поступление(К, К.Товар, 10, 100, 2);

	Перемещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Перемещение.Дата = МоментНазад(1);
	Перемещение.СкладОтправитель = К.Склад;
	Перемещение.СкладПолучатель = К.Склад2;
	НоваяСтрока = Перемещение.Товары.Добавить();
	НоваяСтрока.Номенклатура = К.Товар;
	НоваяСтрока.Количество = 4;
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);

	Отбор = Новый Структура("Партия, Склад", Партия, К.Склад2);
	ПроверитьРавенство(ОстатокРегистра("ПартииТоваров", "Количество", Отбор), 4, "количество партии на складе-получателе");
	ПроверитьРавенство(ОстатокРегистра("ПартииТоваров", "Стоимость", Отбор), 400, "стоимость партии на складе-получателе");

КонецПроцедуры

// Нельзя уменьшить поступление, если товар из него уже продан.
Процедура Тест_УменьшениеПроданногоПоступленияЗапрещено() Экспорт

	К = НовыйКонтекст();
	Партия = Поступление(К, К.Товар, 10, 100, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 8, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

	ПоступлениеОбъект = Партия.ПолучитьОбъект();
	ПоступлениеОбъект.Товары[0].Количество = 5;
	ПроверитьОтказПроведения(ПоступлениеОбъект, "уже списан");

КонецПроцедуры

// Нельзя отменить проведение поступления, товар из которого уже продан.
Процедура Тест_ОтменаПроведенияПроданногоПоступленияЗапрещена() Экспорт

	К = НовыйКонтекст();
	Партия = Поступление(К, К.Товар, 10, 100, 2);

	Продажа = НоваяРеализация(К, 1);
	ДобавитьТовар(Продажа, К.Товар, 8, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);

	ПроверитьОтказЗаписи(Партия.ПолучитьОбъект(), РежимЗаписиДокумента.ОтменаПроведения, "Недостаточно");

КонецПроцедуры

// Поступление задним числом раньше уже проданной партии. До пересчета продажа списана
// по партии 100 (5 x 100 = 500), и отмечена граница пересчета. После пересчета FIFO берет
// более раннюю партию по 50: 5 x 50 = 250, граница сброшена.
Процедура Тест_ПересчетСебестоимостиПослеПроведенияЗаднимЧислом() Экспорт

	К = НовыйКонтекст();
	Поступление(К, К.Товар, 10, 100, 5);

	Продажа = НоваяРеализация(К, 3);
	ДобавитьТовар(Продажа, К.Товар, 5, 200);
	Продажа.Записать(РежимЗаписиДокумента.Проведение);
	ПроверитьРавенство(СебестоимостьПродажи(Продажа.Ссылка), 500, "себестоимость до проведения задним числом");
	ПроверитьИстину(Не ЗначениеЗаполнено(Константы.ГраницаПересчетаСебестоимости.Получить()),
		"граница пересчета пуста, пока документы проводятся по порядку");

	РанняяПартия = Поступление(К, К.Товар, 10, 50, 6);
	ПроверитьРавенство(Константы.ГраницаПересчетаСебестоимости.Получить(),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РанняяПартия, "Дата"), "граница пересчета");

	Результат = ПартионныйУчетСервер.ПересчитатьСебестоимость();
	ПроверитьРавенство(Результат.Ошибка, "", "ошибка пересчета");
	ПроверитьРавенство(СебестоимостьПродажи(Продажа.Ссылка), 250, "себестоимость после пересчета");
	ПроверитьИстину(Не ЗначениеЗаполнено(Константы.ГраницаПересчетаСебестоимости.Получить()),
		"граница пересчета сброшена");

КонецПроцедуры

// Ответственный в документе заполняется текущим пользователем (на нем построен RLS менеджера).
Процедура Тест_ОтветственныйЗаполняетсяТекущимПользователем() Экспорт

	К = НовыйКонтекст();
	Партия = Поступление(К, К.Товар, 1, 100, 1);

	Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "Ответственный");
	ПроверитьИстину(ЗначениеЗаполнено(Ответственный), "ответственный заполнен");
	ПроверитьРавенство(Ответственный, ПараметрыСеанса.ТекущийПользователь, "ответственный - текущий пользователь");

КонецПроцедуры

// Документ с датой в закрытом периоде записать нельзя.
Процедура Тест_ДатаЗапретаИзменения() Экспорт

	К = НовыйКонтекст();
	Константы.ДатаЗапретаИзменения.Установить(НачалоДня(ТекущаяДатаСеанса()) - 86400);

	ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата = НачалоДня(ТекущаяДатаСеанса()) - 2 * 86400;
	ДокументОбъект.Контрагент = К.Поставщик;
	ДокументОбъект.Склад = К.Склад;
	ДобавитьТовар(ДокументОбъект, К.Товар, 1, 100);
	ПроверитьОтказЗаписи(ДокументОбъект, РежимЗаписиДокумента.Запись, "закрыт");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тесты в порядке выполнения.
//
// Возвращаемое значение:
//  СписокЗначений - значение: имя экспортной процедуры теста, представление: описание.
//
Функция СписокТестов()

	Тесты = Новый СписокЗначений;
	Тесты.Добавить("Тест_ПроверкаИНН", "Проверка ИНН по контрольным разрядам");
	Тесты.Добавить("Тест_СписаниеПартийПоFIFO", "Себестоимость списывается по FIFO");
	Тесты.Добавить("Тест_КонтрольОстатковПриРеализации", "Нельзя продать больше остатка");
	Тесты.Добавить("Тест_ПовторяющаясяНоменклатураНеОбходитКонтроль", "Дубли строк не обходят контроль остатков");
	Тесты.Добавить("Тест_РезервУменьшаетСвободныйОстаток", "Резерв уменьшает свободный остаток");
	Тесты.Добавить("Тест_РеализацияПоЗаказуСнимаетРезерв", "Отгрузка по заказу снимает резерв");
	Тесты.Добавить("Тест_ЗакрытиеЗаказаОсвобождаетРезерв", "Закрытие заказа освобождает резерв");
	Тесты.Добавить("Тест_ОтгрузкаСверхЗаказаЗапрещена", "Нельзя отгрузить сверх заказа");
	Тесты.Добавить("Тест_ПерепроведениеОтгрузкиПоЗакрытомуЗаказу",
		"Отгрузку по закрытому заказу можно перепровести, новую - нельзя");
	Тесты.Добавить("Тест_ПеремещениеПереноситПартию", "Перемещение переносит партию с себестоимостью");
	Тесты.Добавить("Тест_УменьшениеПроданногоПоступленияЗапрещено", "Нельзя уменьшить проданное поступление");
	Тесты.Добавить("Тест_ОтменаПроведенияПроданногоПоступленияЗапрещена",
		"Нельзя отменить проведение проданного поступления");
	Тесты.Добавить("Тест_ПересчетСебестоимостиПослеПроведенияЗаднимЧислом",
		"Пересчет себестоимости после проведения задним числом");
	Тесты.Добавить("Тест_ОтветственныйЗаполняетсяТекущимПользователем", "Ответственный - текущий пользователь");
	Тесты.Добавить("Тест_ДатаЗапретаИзменения", "Дата запрета изменения блокирует запись");
	Возврат Тесты;

КонецФункции

#Область Данные

// Создает изолированный набор справочников для теста.
//
// Возвращаемое значение:
//  Структура - Склад, Склад2, Поставщик, Клиент, Товар.
//
Функция НовыйКонтекст()

	// Тест не должен зависеть от настроек базы.
	Константы.ДатаЗапретаИзменения.Установить(Дата(1, 1, 1));
	Константы.ГраницаПересчетаСебестоимости.Установить(Дата(1, 1, 1));

	Суффикс = Лев(СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""), 8);

	Единица = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	Единица.Наименование = "шт";
	Единица.Записать();

	Контекст = Новый Структура;
	Контекст.Вставить("Склад", НовыйСклад("Тест склад 1 " + Суффикс));
	Контекст.Вставить("Склад2", НовыйСклад("Тест склад 2 " + Суффикс));
	Контекст.Вставить("Поставщик", НовыйКонтрагент("Тест поставщик " + Суффикс));
	Контекст.Вставить("Клиент", НовыйКонтрагент("Тест клиент " + Суффикс));

	Товар = Справочники.Номенклатура.СоздатьЭлемент();
	Товар.Наименование = "Тест товар " + Суффикс;
	Товар.Артикул = "T-" + Суффикс;
	Товар.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	Товар.ЕдиницаИзмерения = Единица.Ссылка;
	Товар.Записать();
	Контекст.Вставить("Товар", Товар.Ссылка);

	Возврат Контекст;

КонецФункции

Функция НовыйСклад(Наименование)

	Объект = Справочники.Склады.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Функция НовыйКонтрагент(Наименование)

	Объект = Справочники.Контрагенты.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Создает и проводит поступление.
//
// Параметры:
//  К - Структура - контекст теста.
//  Товар - СправочникСсылка.Номенклатура - товар.
//  Количество - Число - количество.
//  Цена - Число - закупочная цена.
//  ЧасовНазад - Число - дата документа относительно текущего момента.
//
// Возвращаемое значение:
//  ДокументСсылка.ПоступлениеТоваров - проведенное поступление (партия).
//
Функция Поступление(К, Товар, Количество, Цена, ЧасовНазад)

	ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ДокументОбъект.Дата = МоментНазад(ЧасовНазад);
	ДокументОбъект.Контрагент = К.Поставщик;
	ДокументОбъект.Склад = К.Склад;
	ДобавитьТовар(ДокументОбъект, Товар, Количество, Цена);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;

КонецФункции

// Создает и проводит заказ «К отгрузке» (с резервом).
//
// Параметры:
//  К - Структура - контекст теста.
//  Товар - СправочникСсылка.Номенклатура - товар.
//  Количество - Число - количество.
//  ЧасовНазад - Число - дата документа относительно текущего момента.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказКлиента - проведенный заказ.
//
Функция Заказ(К, Товар, Количество, ЧасовНазад)

	ДокументОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
	ДокументОбъект.Дата = МоментНазад(ЧасовНазад);
	ДокументОбъект.Контрагент = К.Клиент;
	ДокументОбъект.Склад = К.Склад;
	ДокументОбъект.ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса()) + 86400;
	ДокументОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке;
	ДобавитьТовар(ДокументОбъект, Товар, Количество, 200);
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;

КонецФункции

Функция НоваяРеализация(К, ЧасовНазад)

	ДокументОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	ДокументОбъект.Дата = МоментНазад(ЧасовНазад);
	ДокументОбъект.Контрагент = К.Клиент;
	ДокументОбъект.Склад = К.Склад;
	Возврат ДокументОбъект;

КонецФункции

Процедура ДобавитьТовар(ДокументОбъект, Товар, Количество, Цена)

	НоваяСтрока = ДокументОбъект.Товары.Добавить();
	НоваяСтрока.Номенклатура = Товар;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Цена = Цена;

КонецПроцедуры

Функция МоментНазад(ЧасовНазад)

	Возврат ТекущаяДатаСеанса() - ЧасовНазад * 3600;

КонецФункции

// Текущий остаток ресурса регистра накопления с отбором по измерениям.
//
// Параметры:
//  ИмяРегистра - Строка - имя регистра накопления.
//  ИмяРесурса - Строка - имя ресурса.
//  Отбор - Структура - ключ: имя измерения, значение: значение отбора.
//
// Возвращаемое значение:
//  Число - остаток.
//
Функция ОстатокРегистра(ИмяРегистра, ИмяРесурса, Отбор)

	Условия = Новый Массив;
	Запрос = Новый Запрос;
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Условия.Добавить(СтрШаблон("%1 = &%1", ЭлементОтбора.Ключ));
		Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
	КонецЦикла;

	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Остатки.%2Остаток), 0) КАК Значение
		|ИЗ
		|	РегистрНакопления.%1.Остатки(, %3) КАК Остатки",
		ИмяРегистра, ИмяРесурса, СтрСоединить(Условия, " И "));

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Значение;

КонецФункции

Функция ОстатокПартии(Партия, ИмяРесурса)

	Возврат ОстатокРегистра("ПартииТоваров", ИмяРесурса, Новый Структура("Партия", Партия));

КонецФункции

Функция СебестоимостьПродажи(Регистратор)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Продажи.Себестоимость), 0) КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор";

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Себестоимость;

КонецФункции

#КонецОбласти

#Область Утверждения

Процедура ПроверитьРавенство(Фактическое, Ожидаемое, Описание)

	Если Фактическое <> Ожидаемое Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = '%1: ожидалось %2, получено %3'"), Описание, Ожидаемое, Фактическое);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьИстину(Условие, Описание)

	Если Не Условие Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не выполнено условие: %1'"), Описание);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьОтказПроведения(ДокументОбъект, ОжидаемыйФрагмент)

	ПроверитьОтказЗаписи(ДокументОбъект, РежимЗаписиДокумента.Проведение, ОжидаемыйФрагмент);

КонецПроцедуры

// Ожидает, что запись документа завершится отказом с сообщением, содержащим фрагмент текста.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ.
//  РежимЗаписи - РежимЗаписиДокумента - режим записи.
//  ОжидаемыйФрагмент - Строка - фрагмент ожидаемого сообщения.
//
Процедура ПроверитьОтказЗаписи(ДокументОбъект, РежимЗаписи, ОжидаемыйФрагмент)

	ОбщегоНазначения.ЗабратьСообщенияПользователю();
	Попытка
		ДокументОбъект.Записать(РежимЗаписи);
	Исключение
		Сообщения = ОбщегоНазначения.ЗабратьСообщенияПользователю();
		Если СтрНайти(Сообщения, ОжидаемыйФрагмент) = 0 Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Запись отклонена, но без сообщения «%1». Сообщения: %2. Ошибка: %3'"),
				ОжидаемыйФрагмент, Сообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		Возврат;
	КонецПопытки;

	ВызватьИсключение СтрШаблон(НСтр("ru = 'Ожидался отказ записи с сообщением «%1», но документ записан'"),
		ОжидаемыйФрагмент);

КонецПроцедуры

#КонецОбласти

#Область Отчет

Процедура ВывестиЯчейку(ТабличныйДокумент, Ряд, Колонка, Текст, Успешно)

	Ячейка = ТабличныйДокумент.Область(Ряд, Колонка, Ряд, Колонка);
	Ячейка.Текст = Текст;
	Ячейка.ЦветТекста = ?(Успешно, ЦветУспеха(), ЦветОшибки());
	Ячейка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

КонецПроцедуры

Функция ЦветУспеха()

	Возврат Новый Цвет(0, 128, 0);

КонецФункции

Функция ЦветОшибки()

	Возврат Новый Цвет(192, 0, 0);

КонецФункции

#КонецОбласти

#КонецОбласти
